`November 17, 2022`

### **Pandas Manipulation**

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df = pd.DataFrame(data=np.random.randint(10, 100, (5, 4)),
                  columns='A B C D'.split()
)

df

    A   B   C   D
0  77  21  55  77
1  54  93  66  97
2  43  45  85  35
3  65  16  93  11
4  36  60  76  94

**Adding Data**

    Membuat baris baru

In [ ]:
# Untuk penambahan baris baru, jika data yang sudah ada bertipe int dan ditambahkan data
    # yang bertipe float, maka semua data akan dikonversi menjadi float.

# Sebaliknya, jika data yang sudah ada bertipe float dan ditambahkan data yang bertipe
    # int, maka data yang baru akan dikonversi menjadi float. 
    
df.loc['new'] = [1.2, 3.3, 45.6, 10.2]
df

        A     B     C     D
0    47.0  31.0  71.0  66.0
1    85.0  56.0  12.0  74.0
2    56.0  51.0  71.0  71.0
3    82.0  74.0  61.0  43.0
4    39.0  33.0  57.0  59.0
new   1.2   3.3  45.6  10.2

    Membuat kolom baru

In [ ]:
# Pada penambahan kolom baru, tipe angka tidak akan berubah meskipun kita memiliki integer dan float. 

df['E'] = [1.2, 3.3, 45.6, 10.2, 98.7]
df

    A   B   C   D     E
0  72  33  34  74   1.2
1  70  98  45  14   3.3
2  29  59  60  96  45.6
3  69  12  37  81  10.2
4  64  13  86  31  98.7

In [ ]:
# Menyelipkan kolom baru pada index tertentu dengan menggunakan .insert()
df.insert(0, 'New Col', [10, 20, 30, 40, 50])
df

   New Col   A   B   C   D     E
0       10  72  33  34  74   1.2
1       20  70  98  45  14   3.3
2       30  29  59  60  96  45.6
3       40  69  12  37  81  10.2
4       50  64  13  86  31  98.7

**Removing Data**

    Menghapus kolom

In [ ]:
# Hapus kolom hanya pada cell ini (tidak permanen)
# .drop() sifatnya tidak inpalce/permanen
# Kolom --> axis = 1

df.drop('New Col', axis=1)

    A   B   C   D     E
0  72  33  34  74   1.2
1  70  98  45  14   3.3
2  29  59  60  96  45.6
3  69  12  37  81  10.2
4  64  13  86  31  98.7

In [ ]:
# Kalau mau permanen, tambahkan parameter inplace=True
df.drop('New Col', axis=1, inplace=True)
df

    A   B   C   D     E
0  72  33  34  74   1.2
1  70  98  45  14   3.3
2  29  59  60  96  45.6
3  69  12  37  81  10.2
4  64  13  86  31  98.7

In [ ]:
# Alternatif jika tidak menggunakan inplace=True adalah dengan menimpa ke variabel yang sama
df = df.drop('E', axis=1)
df

    A   B   C   D
0  72  33  34  74
1  70  98  45  14
2  29  59  60  96
3  69  12  37  81
4  64  13  86  31

    Menghapus baris

In [ ]:
# Hapus baris secara tidak permanen
# Baris --> axis = 0

df.drop(4, axis=0)

    A   B   C   D
0  72  33  34  74
1  70  98  45  14
2  29  59  60  96
3  69  12  37  81

In [ ]:
# Kalau mau permanen, tambahkan parameter inplace=True
    # atau timpa ke variabel yang sama

df.drop(4, axis=0, inplace=True)
df

    A   B   C   D
0  77  21  55  77
1  54  93  66  97
2  43  45  85  35
3  65  16  93  11

#### **Index & Multi-Index**

In [ ]:
# Menjadikan suatu kolom sebagai index menggunakan set_index()
df_new = df.copy()
df_new.set_index('A', inplace=True)
df_new

     B   C   D
A
77  21  55  77
54  93  66  97
43  45  85  35
65  16  93  11

In [ ]:
# Mengembalikan index ke nilai default menggunakan reset_index()
df_new.reset_index(inplace=True)
df_new

    A   B   C   D
0  77  21  55  77
1  54  93  66  97
2  43  45  85  35
3  65  16  93  11

In [ ]:
# Mengganti nama kolom
df_new.rename(columns={'A':'X'}, inplace=True)
df_new

    X   B   C   D
0  77  21  55  77
1  54  93  66  97
2  43  45  85  35
3  65  16  93  11

In [ ]:
# Jika ingin mengubah beberapa nama kolom sekaligus
df_new.rename(columns={'B':'Y', 'C':'Z'}, inplace=True)
df_new

    X   Y   Z   D
0  77  21  55  77
1  54  93  66  97
2  43  45  85  35
3  65  16  93  11

    Multi-Index

In [ ]:
outside = ['Jakarta', 'Jakarta', 'Jakarta', 'Bandung', 'Bandung', 'Bandung']
inside = [1, 2, 3, 1, 2, 3]

hier_index = list(zip(outside, inside))
hier_index

[('Jakarta', 1),
 ('Jakarta', 2),
 ('Jakarta', 3),
 ('Bandung', 1),
 ('Bandung', 2),
 ('Bandung', 3)]

In [ ]:
type(hier_index)

list

In [ ]:
# Konversi menjadi multi-index
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('Jakarta', 1),
            ('Jakarta', 2),
            ('Jakarta', 3),
            ('Bandung', 1),
            ('Bandung', 2),
            ('Bandung', 3)],
           )

In [ ]:
type(hier_index)

pandas.core.indexes.multi.MultiIndex

In [ ]:
# Buat array 6x2 untuk mengisi DataFrame
np.random.seed(1) # Digunakan agar random numbers tidak berubah ketika cell di-run ulang. Isinya bisa angka int berapapun.
values = np.random.randint(30, 100, (6, 2))
values

array([[67, 42],
       [39, 35],
       [94, 46],
       [31, 36],
       [55, 80],
       [50, 48]])

In [ ]:
# Buat DataFrame berisi Multi-Index
df_multi = pd.DataFrame(data=values, 
                        index=hier_index, 
                        columns=['Restaurant A', 'Restaurant B'])

df_multi

           Restaurant A  Restaurant B
Jakarta 1            67            42
        2            39            35
        3            94            46
Bandung 1            31            36
        2            55            80
        3            50            48

In [ ]:
# Indexing kolom
df_multi[['Restaurant A']]

           Restaurant A
Jakarta 1            67
        2            39
        3            94
Bandung 1            31
        2            55
        3            50

In [ ]:
# Cara lain dengan menggunakan loc
df_multi.loc[:, ['Restaurant A']]

           Restaurant A
Jakarta 1            67
        2            39
        3            94
Bandung 1            31
        2            55
        3            50

In [ ]:
# Indexing baris
df_multi.loc['Bandung']

   Restaurant A  Restaurant B
1            31            36
2            55            80
3            50            48

In [ ]:
df_multi.iloc[0:4]

           Restaurant A  Restaurant B
Jakarta 1            67            42
        2            39            35
        3            94            46
Bandung 1            31            36

In [ ]:
df_multi.loc['Bandung', ['Restaurant A']]

   Restaurant A
1            31
2            55
3            50

In [ ]:
# Indexing dengan menggunakan .xs / cross-section
# Lebih mudah untuk mengakses data pada DataFrame yang mengandung multi-index

df_multi.xs(('Bandung', 2))

Restaurant A    55
Restaurant B    80
Name: (Bandung, 2), dtype: int32

In [ ]:
# Jika ingin mengakses 1 nilai saja. 
# Contoh: Mengambil data restaurant A location 3 di Jakarta
df_multi['Restaurant A'][2]

94

In [ ]:
# Memanggil nama index baris
df_multi.index.names

FrozenList([None, None])

In [ ]:
# Memberikan nama untuk tiap index
df_multi.index.names = ['City', 'Location']
df_multi

                  Restaurant A  Restaurant B
City    Location
Jakarta 1                   67            42
        2                   39            35
        3                   94            46
Bandung 1                   31            36
        2                   55            80
        3                   50            48

In [ ]:
df_multi.index.names

FrozenList(['City', 'Location'])

In [ ]:
# Indexing location 3 untuk tiap kota
df_multi.xs(3, level='Location')

         Restaurant A  Restaurant B
City
Jakarta            94            46
Bandung            50            48

In [ ]:
# Cara lain dengan menggunakan column index number untuk parameter level
df_multi.xs(3, level=1)

         Restaurant A  Restaurant B
City
Jakarta            94            46
Bandung            50            48

#### **Sorting**

In [ ]:
# Sifatnya tidak permanen
df_multi.reset_index(inplace=True)
df_multi

      City  Location  Restaurant A  Restaurant B
0  Jakarta         1            67            42
1  Jakarta         2            39            35
2  Jakarta         3            94            46
3  Bandung         1            31            36
4  Bandung         2            55            80
5  Bandung         3            50            48

In [ ]:
df_multi.set_index('City', inplace=True)
df_multi

         Location  Restaurant A  Restaurant B
City
Jakarta         1            67            42
Jakarta         2            39            35
Jakarta         3            94            46
Bandung         1            31            36
Bandung         2            55            80
Bandung         3            50            48

In [ ]:
# By default, ascending = True
df_multi.sort_values(by=['Restaurant A'])

         Location  Restaurant A  Restaurant B
City
Bandung         1            31            36
Jakarta         2            39            35
Bandung         3            50            48
Bandung         2            55            80
Jakarta         1            67            42
Jakarta         3            94            46

In [ ]:
# Dari paling besar ke terkecil
df_multi.sort_values(by=['Restaurant A'], ascending=False)

         Location  Restaurant A  Restaurant B
City
Jakarta         3            94            46
Jakarta         1            67            42
Bandung         2            55            80
Bandung         3            50            48
Jakarta         2            39            35
Bandung         1            31            36

In [ ]:
# Mengurutkan berdasarkan lebih dari 1 kolom
# Sorting berdasarkan kolom Restaurant A terlebih dahulu, baru berdasarkan Restaurant B
df_multi.sort_values(by=['Restaurant A', 'Restaurant B'], ascending=[True, False])

         Location  Restaurant A  Restaurant B
City
Bandung         1            31            36
Jakarta         2            39            35
Bandung         3            50            48
Bandung         2            55            80
Jakarta         1            67            42
Jakarta         3            94            46

In [ ]:
# Sorting berdasarkan index
df_multi.sort_index()

         Location  Restaurant A  Restaurant B
City
Bandung         1            31            36
Bandung         2            55            80
Bandung         3            50            48
Jakarta         1            67            42
Jakarta         2            39            35
Jakarta         3            94            46

## **Pandas Functionality**

Explore DataFrame
- .head()
- .tail()
- .info()
- .shape
- .columns
- .dtypes

Descriptive Statistics
- .describe()
- .min() .max() .mean() .median() .mode() .std()
- .unique() .nunique() .value_counts()

In [ ]:
# Load dataset untuk file .csv

# Kalau file yang mau di-import berada di folder yang berbeda dengan file Jupyter Notebook
    # yang sedang digunakan, tambahkan r sebelum mendefinisikan address di mana file csv
    # tersebut berada.

df = pd.read_csv(r'D:\Salaries.csv')
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [ ]:
# Kalau file yang mau di-import berada di folder yang sama dengan file Jupyter Notebook
    # yang sedang digunakan, mengimpor filenya bisa langsung seperti cara di bawah ini.
df = pd.read_csv('Salaries.csv')
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

### **Basic Functionality**

In [ ]:
# Menampilkan 1 baris awal pada dataset
# .head() & .tail() secara default akan mengembalikan 5 baris.
    # Namun, kita bisa mengatur jumlah baris yang ingin ditampilkan
df.head(1)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [ ]:
# Mengecek baris terakhir pada dataset
df.tail(1)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [ ]:
# Menampilkan informasi semua kolom
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [ ]:
# Mengecek jumlah missing value pada tiap kolom
# Bisa menggunakan .isna() atau .isnull()
df.isna().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                609
OvertimePay              4
OtherPay                 4
Benefits             36163
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              148654
dtype: int64

In [ ]:
# Alternatif 
df.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                609
OvertimePay              4
OtherPay                 4
Benefits             36163
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              148654
dtype: int64

In [ ]:
# Melihat ukuran DataFrame (baris, kolom)
df.shape

(148654, 13)

In [ ]:
# Mengecek nama kolom
df.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [ ]:
# Mengecek tipe data tiap kolom
df.dtypes

Id                    int64
EmployeeName         object
JobTitle             object
BasePay             float64
OvertimePay         float64
OtherPay            float64
Benefits            float64
TotalPay            float64
TotalPayBenefits    float64
Year                  int64
Notes               float64
Agency               object
Status              float64
dtype: object

### **Descriptive Statistics**

In [ ]:
# Menampilkan quick summary descriptive stats
# By default akan menampilkan kolom numerikal saja
df.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
count,148654.000000,148045.000000,148650.000000,148650.000000,112491.000000,148654.000000,148654.000000,148654.000000,0.0,0.0
mean,74327.500000,66325.448841,5066.059886,3648.767297,25007.893151,74768.321972,93692.554811,2012.522643,NaN,NaN
std,42912.857795,42764.635495,11454.380559,8056.601866,15402.215858,50517.005274,62793.533483,1.117538,NaN,NaN
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN,NaN
25%,37164.250000,33588.200000,0.000000,0.000000,11535.395000,36168.995000,44065.650000,2012.000000,NaN,NaN
50%,74327.500000,65007.450000,0.000000,811.270000,28628.620000,71426.610000,92404.090000,2013.000000,NaN,NaN
75%,111490.750000,94691.050000,4658.175000,4236.065000,35566.855000,105839.135000,132876.450000,2014.000000,NaN,NaN
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN,NaN

In [ ]:
# Jika ingin mengecek descriptive stats kolom kategorikal,
    # tambahkan parameter include = 'object'

df.describe(include='object')

# freq = jumlah top value muncul di suatu kolom

       EmployeeName          JobTitle         Agency
count        148654            148654         148654
unique       110811              2159              1
top       Kevin Lee  Transit Operator  San Francisco
freq             13              7036         148654

In [ ]:
# Jika ingin menampilkan semua jenis kolom sekaligus
df.describe(include='all')

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
count,148654.000000,148654,148654,148045.000000,148650.000000,148650.000000,112491.000000,148654.000000,148654.000000,148654.000000,0.0,148654,0.0
unique,NaN,110811,2159,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,NaN
top,NaN,Kevin Lee,Transit Operator,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,San Francisco,NaN
freq,NaN,13,7036,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,148654,NaN
mean,74327.500000,NaN,NaN,66325.448841,5066.059886,3648.767297,25007.893151,74768.321972,93692.554811,2012.522643,NaN,NaN,NaN
std,42912.857795,NaN,NaN,42764.635495,11454.380559,8056.601866,15402.215858,50517.005274,62793.533483,1.117538,NaN,NaN,NaN
min,1.000000,NaN,NaN,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN,NaN,NaN
25%,37164.250000,NaN,NaN,33588.200000,0.000000,0.000000,11535.395000,36168.995000,44065.650000,2012.000000,NaN,NaN,NaN
50%,74327.500000,NaN,NaN,65007.450000,0.000000,811.270000,28628.620000,71426.610000,92404.090000,2013.000000,NaN,NaN,NaN
75%,111490.750000,NaN,NaN,94691.050000,4658.175000,4236.065000,35566.855000,105839.135000,132876.450000,2014.000000,NaN,NaN,NaN
max,148654.000000,NaN,NaN,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN,NaN,NaN

#### **Kolom Numerikal**

In [ ]:
# Mean (rata-rata) suatu kolom
df['BasePay'].mean()

66325.44884050643

In [ ]:
# Median (nilai tengah suatu kolom)
df['BasePay'].median()

65007.45

In [ ]:
# Mode (nilai yang paling sering muncul pada suatu kolom)
df['Year'].mode()

0    2014
dtype: int64

In [ ]:
# Nilai minimum
df['BasePay'].min()

-166.01

In [ ]:
# Nilai maximum
df['BasePay'].max()

319275.01

In [ ]:
# Nilai standard deviation
df['BasePay'].std()

42764.63549525958

In [ ]:
# Count
df['BasePay'].count()

148045

In [ ]:
# Menghitung frekuensi dari tiap unique value pada suatu kolom
df['Year'].value_counts()

2014    38123
2013    37606
2012    36766
2011    36159
Name: Year, dtype: int64

In [ ]:
# Menghitung frekuensi dari tiap unique value pada suatu kolom
# Jika ingin ditampilkan dalam bentuk persentase, gunakan parameter
    # normalize=True

round(df['Year'].value_counts(normalize=True) * 100, 2)

2014    25.65
2013    25.30
2012    24.73
2011    24.32
Name: Year, dtype: float64

In [ ]:
# Contoh lain
# Mengecek top 10 job title
df['JobTitle'].value_counts().head(10)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Custodian                       2418
TRANSIT OPERATOR                2388
Firefighter                     2359
Recreation Leader               1971
Patient Care Assistant          1945
Name: JobTitle, dtype: int64

In [ ]:
# Mengecek top 10 job title dalam bentuk persentase 
    # dengan pembulatan 2 angka di belakang koma.
round(df['JobTitle'].value_counts(normalize=True) * 100, 2).head(10)

Transit Operator                4.73
Special Nurse                   2.95
Registered Nurse                2.51
Public Svc Aide-Public Works    1.69
Police Officer 3                1.63
Custodian                       1.63
TRANSIT OPERATOR                1.61
Firefighter                     1.59
Recreation Leader               1.33
Patient Care Assistant          1.31
Name: JobTitle, dtype: float64

#### **Kolom Kategorikal**

In [ ]:
# Nilai yang paling sering muncul
df['JobTitle'].mode()

0    Transit Operator
dtype: object

In [ ]:
# Nilai yang paling sering muncul
# Jika ingin mengambil string value-nya saja
df['JobTitle'].mode().values[0]

'Transit Operator'

In [ ]:
# Menampilkan nilai unik pada suatu kolom
df['JobTitle'].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

In [ ]:
# Menampilkan jumlah nilai unik (kategori) pada suatu kolom
df['JobTitle'].nunique()

2159

### **Missing Value**

In [ ]:
df_num = pd.DataFrame({
                'A': [1, 2, np.nan, 10],
                'B': [23, np.nan, np.nan, 4],
                'C': [10, 20, 30, 40]
})

df_num

      A     B   C
0   1.0  23.0  10
1   2.0   NaN  20
2   NaN   NaN  30
3  10.0   4.0  40

In [ ]:
# Default-nya adalah axis=0
df_num.isna().sum()

A    1
B    2
C    0
dtype: int64

In [ ]:
# Cek jumlah missing value pada tiap baris
df_num.isna().sum(axis=1)

0    0
1    1
2    2
3    0
dtype: int64

In [ ]:
# Menghapus missing value menggunakan .dropna()
# Default-nya menghapus berdasarkan baris (axis=0)
# Sifatnya tidak permanen
# Jika mau permanen, tambahkan inplace=True atau timpa ke suatu variabel
df_num.dropna()

      A     B   C
0   1.0  23.0  10
3  10.0   4.0  40

In [ ]:
# Menghapus NaN value berdasarkan kolom (axis=1) secara permanen
df_drop = df_num.copy()
df_drop.dropna(axis=1, inplace=True)
df_drop

    C
0  10
1  20
2  30
3  40

In [ ]:
df_num

      A     B   C
0   1.0  23.0  10
1   2.0   NaN  20
2   NaN   NaN  30
3  10.0   4.0  40

In [ ]:
# Threshold berarti jumlah minimal data yang bukan berupa missing value.
# By default, axis pada thresh adalah axis=0
# Misal, thresh = 3, berarti hanya baris yang memiliki minimal 3 data poin
    # yang bukan bernilai NaN yang tidak akan terhapus
df_num.dropna(thresh=3)

      A     B   C
0   1.0  23.0  10
3  10.0   4.0  40

In [ ]:
# Menghapus kolom yang tidak memiliki 3 data poin
df_num.dropna(axis=1, thresh=3)

      A   C
0   1.0  10
1   2.0  20
2   NaN  30
3  10.0  40

In [ ]:
# Mengisi missing value dengan nilai tertentu
# Sifat default-nya tidak permanen
df_num.fillna(value='Unknown')

         A        B   C
0      1.0     23.0  10
1      2.0  Unknown  20
2  Unknown  Unknown  30
3     10.0      4.0  40

In [ ]:
# Jika hanya ingin mengisi missing value pada suatu kolom
df_num['A'].fillna(df_num['A'].mean())

0     1.000000
1     2.000000
2     4.333333
3    10.000000
Name: A, dtype: float64

In [ ]:
# Mengisi missing value pada kolom A dengan nilai mean dari kolom A secara permanen
df_num['A'].fillna(df_num['A'].mean(), inplace=True)
df_num

           A     B   C
0   1.000000  23.0  10
1   2.000000   NaN  20
2   4.333333   NaN  30
3  10.000000   4.0  40

### **Data Aggregation**

In [ ]:
df['Year'].value_counts(ascending=True)

2011    36159
2012    36766
2013    37606
2014    38123
Name: Year, dtype: int64

In [ ]:
# Mengelompokkan data berdasarkan kolom Year
# Jika tidak dipasangkan dengan suatu aggregation function, maka 
    # return value-nya adalah group by object
df.groupby('Year')

In [ ]:
# Mencari nilai rata-rata dari tiap kolom numerikal berdasarkan kategori pada kolom Year 
df.groupby('Year').mean()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Notes,Status
Year,,,,,,,,,
2011,18080.0,63595.956517,4531.065429,3617.081926,NaN,71744.103871,71744.103871,NaN,NaN
2012,54542.5,65436.406857,5023.417824,3653.437583,26439.966967,74113.262265,100553.229232,NaN,NaN
2013,91728.5,69630.030216,5281.641980,3819.969007,23829.076572,77611.443142,101440.519714,NaN,NaN
2014,129593.0,66564.421924,5401.993737,3505.421251,24789.601756,75463.918140,100250.918884,NaN,NaN

In [ ]:
# Mengecek rata-rata BasePay dan OvertimePay tiap tahunnya
df.groupby('Year').mean()[['BasePay', 'OvertimePay']]

           BasePay  OvertimePay
Year
2011  63595.956517  4531.065429
2012  65436.406857  5023.417824
2013  69630.030216  5281.641980
2014  66564.421924  5401.993737

In [ ]:
# Grouping lebih dari 1 kolom
df.groupby(['Year', 'JobTitle']).mean()[['BasePay', 'OvertimePay']]

                                          BasePay   OvertimePay
Year JobTitle
2011 ACCOUNT CLERK                   43300.806506    373.200843
     ACCOUNTANT                      46643.172000      0.000000
     ACCOUNTANT INTERN               28732.663958     24.430625
     ACUPUNCTURIST                   66374.400000      0.000000
     ADMINISTRATIVE ANALYST          63435.628602      0.000000
...                                           ...           ...
2014 Wire Rope Cable Maint Sprv      93904.720000  79173.850000
     Worker's Comp Supervisor 1      54505.333333      0.000000
     Worker's Compensation Adjuster  69915.985385      0.000000
     X-Ray Laboratory Aide           45490.340286   4530.769714
     Youth Comm Advisor              32417.420000      0.000000

[4137 rows x 2 columns]

In [ ]:
# Jika ingin melihat lebih banyak jumlah baris pada outcome
pd.set_option('display.max_rows', 5000) # max 5000 rows
pd.set_option('display.max_columns', 100) # max 100 columns

In [ ]:
df.groupby('Year').mean()[['TotalPay']]

          TotalPay
Year
2011  71744.103871
2012  74113.262265
2013  77611.443142
2014  75463.918140

In [ ]:
# Mengakses rata-rata TotalPay tahun 2012 menggunakan .loc
df.groupby('Year').mean()[['TotalPay']].loc[2012]

TotalPay    74113.262265
Name: 2012, dtype: float64

In [ ]:
# Mengakses rata-rata TotalPay tahun 2012 menggunakan .iloc
df.groupby('Year').mean()[['TotalPay']].iloc[1]

TotalPay    74113.262265
Name: 2012, dtype: float64

In [ ]:
# Membuat kolom baru dari hasil operasi math kolom-kolom yang sudah ada
df['TotalBenefits'] = df['BasePay'] + df['OtherPay']
df.head(3)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,TotalBenefits
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN,567595.43
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN,293777.40
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN,229191.73

In [ ]:
# Transpose describe function
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Id,148654.0,74327.500000,42912.857795,1.00,37164.250,74327.50,111490.750,148654.00
BasePay,148045.0,66325.448841,42764.635495,-166.01,33588.200,65007.45,94691.050,319275.01
OvertimePay,148650.0,5066.059886,11454.380559,-0.01,0.000,0.00,4658.175,245131.88
OtherPay,148650.0,3648.767297,8056.601866,-7058.59,0.000,811.27,4236.065,400184.25
Benefits,112491.0,25007.893151,15402.215858,-33.89,11535.395,28628.62,35566.855,96570.66
TotalPay,148654.0,74768.321972,50517.005274,-618.13,36168.995,71426.61,105839.135,567595.43
TotalPayBenefits,148654.0,93692.554811,62793.533483,-618.13,44065.650,92404.09,132876.450,567595.43
Year,148654.0,2012.522643,1.117538,2011.00,2012.000,2013.00,2014.000,2014.00
Notes,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Status,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
TotalBenefits,148045.0,69971.110248,45706.207733,-618.13,35693.150,67193.44,99131.820,567595.43

In [ ]:
# Menampilkan descriptive stats kolom Benefits saja
df.describe().T.loc['Benefits']

count    112491.000000
mean      25007.893151
std       15402.215858
min         -33.890000
25%       11535.395000
50%       28628.620000
75%       35566.855000
max       96570.660000
Name: Benefits, dtype: float64